## 23-DataFramePandas

In [9]:
import numpy as np
import pandas as pd

In [2]:
## DataFrame: serilerin yanyana gelmesiyle oluşturulmuş bir Excel tablosu gibi düşünülebilir

In [3]:
data = np.random.randn(4,3)  ## normal distribution ile 4e 3 bir matrix verir

In [4]:
data

array([[-1.02318114, -0.53284713,  0.12680036],
       [ 1.73340431, -0.59930449, -0.60234711],
       [ 1.12611939,  0.56557007,  0.19857405],
       [-2.73291958,  0.1230956 , -2.41752206]])

In [5]:
dataFrame = pd.DataFrame(data)

In [6]:
dataFrame

          0         1         2
0 -1.023181 -0.532847  0.126800
1  1.733404 -0.599304 -0.602347
2  1.126119  0.565570  0.198574
3 -2.732920  0.123096 -2.417522

In [7]:
dataFrame[0]   # ilk column'ı getirir.. matrixteki gibi row'u getirmez..

0   -1.023181
1    1.733404
2    1.126119
3   -2.732920
Name: 0, dtype: float64

In [8]:
type(dataFrame)   ## Bir series'dir

pandas.core.frame.DataFrame

In [9]:
# DataFrame'lere index nasıl atanır?

In [10]:
dataFrame1 = pd.DataFrame(data, index=["Ali", "Ayşe", "Hatice", "Said"], columns=["Maaş", "Yaş", "Çalışma saati"])

In [11]:
dataFrame1

            Maaş       Yaş  Çalışma saati
Ali    -1.023181 -0.532847       0.126800
Ayşe    1.733404 -0.599304      -0.602347
Hatice  1.126119  0.565570       0.198574
Said   -2.732920  0.123096      -2.417522

In [12]:
dataFrame1["Yaş"]

Ali      -0.532847
Ayşe     -0.599304
Hatice    0.565570
Said      0.123096
Name: Yaş, dtype: float64

In [13]:
## dataFrame1["Said"]   ==> # Hata veriyor, row alınmıyor

In [14]:
dataFrame1[["Maaş" , "Yaş"]]

            Maaş       Yaş
Ali    -1.023181 -0.532847
Ayşe    1.733404 -0.599304
Hatice  1.126119  0.565570
Said   -2.732920  0.123096

In [15]:
dataFrame1.loc["Said"]   #loc, location yazınca hata vermeden ilgili row'u getirir

Maaş            -2.732920
Yaş              0.123096
Çalışma saati   -2.417522
Name: Said, dtype: float64

In [16]:
dataFrame1.loc["Ali"]

Maaş            -1.023181
Yaş             -0.532847
Çalışma saati    0.126800
Name: Ali, dtype: float64

In [17]:
dataFrame1.iloc[1] # iloc ==> index location.. row getirir

Maaş             1.733404
Yaş             -0.599304
Çalışma saati   -0.602347
Name: Ayşe, dtype: float64

In [18]:
dataFrame1["Emeklilik yaşı"] = dataFrame1["Yaş"] + dataFrame1["Yaş"]

In [19]:
dataFrame1

            Maaş       Yaş  Çalışma saati  Emeklilik yaşı
Ali    -1.023181 -0.532847       0.126800       -1.065694
Ayşe    1.733404 -0.599304      -0.602347       -1.198609
Hatice  1.126119  0.565570       0.198574        1.131140
Said   -2.732920  0.123096      -2.417522        0.246191

In [20]:
# column silme nasıl yapılır? drop(column_name,axis=1) diyerek silerek

dataFrame1.drop("Emeklilik yaşı", axis=1)

            Maaş       Yaş  Çalışma saati
Ali    -1.023181 -0.532847       0.126800
Ayşe    1.733404 -0.599304      -0.602347
Hatice  1.126119  0.565570       0.198574
Said   -2.732920  0.123096      -2.417522

In [21]:
# row silme nasıl yapılır?   drop(row_name,axis= 0)  diyerek silme işlemi yapılır

In [22]:
dataFrame1.drop("Hatice", axis=0)

          Maaş       Yaş  Çalışma saati  Emeklilik yaşı
Ali  -1.023181 -0.532847       0.126800       -1.065694
Ayşe  1.733404 -0.599304      -0.602347       -1.198609
Said -2.732920  0.123096      -2.417522        0.246191

In [23]:
dataFrame1

            Maaş       Yaş  Çalışma saati  Emeklilik yaşı
Ali    -1.023181 -0.532847       0.126800       -1.065694
Ayşe    1.733404 -0.599304      -0.602347       -1.198609
Hatice  1.126119  0.565570       0.198574        1.131140
Said   -2.732920  0.123096      -2.417522        0.246191

In [24]:
dataFrame1.drop("Emeklilik yaşı", axis=1, inplace= True)  # içinde bu işlemi yap, serielere uygula,, demektir. 
## inplace  yazılmazsa orijinal dosya sabit kalır, yazılırsa orijinal dosyada değişiklik yapılır

In [25]:
dataFrame1.loc["Said"]

Maaş            -2.732920
Yaş              0.123096
Çalışma saati   -2.417522
Name: Said, dtype: float64

In [26]:
dataFrame1.loc["Said"]["Maaş"]

-2.7329195766281527

In [27]:
dataFrame1.loc["Said"]["Yaş"]

0.12309560031938187

In [28]:
dataFrame1.loc["Said", "Maaş"]

-2.7329195766281527

In [29]:
dataFrame1

            Maaş       Yaş  Çalışma saati
Ali    -1.023181 -0.532847       0.126800
Ayşe    1.733404 -0.599304      -0.602347
Hatice  1.126119  0.565570       0.198574
Said   -2.732920  0.123096      -2.417522

In [30]:
#0'dan küçük değerleri bulmak için:
booleanFrame= dataFrame1 < 0

In [31]:
booleanFrame

         Maaş    Yaş  Çalışma saati
Ali      True   True          False
Ayşe    False   True           True
Hatice  False  False          False
Said     True  False           True

In [32]:
dataFrame1

            Maaş       Yaş  Çalışma saati
Ali    -1.023181 -0.532847       0.126800
Ayşe    1.733404 -0.599304      -0.602347
Hatice  1.126119  0.565570       0.198574
Said   -2.732920  0.123096      -2.417522

In [33]:
dataFrame1[booleanFrame]     ## filtreleme yapılır: sadece 0'dan küçük olanların değerlerini getirir

## Bunu : dataFrame1[ dataFrame1 < 0]   : olarak da yazılabilir. Aynı sonucu getirir

            Maaş       Yaş  Çalışma saati
Ali    -1.023181 -0.532847            NaN
Ayşe         NaN -0.599304      -0.602347
Hatice       NaN       NaN            NaN
Said   -2.732920       NaN      -2.417522

In [34]:
## Bu tarz işlemler columnlar arasında yapılabilir mi?

In [35]:
dataFrame1["Yaş"]

Ali      -0.532847
Ayşe     -0.599304
Hatice    0.565570
Said      0.123096
Name: Yaş, dtype: float64

In [36]:
dataFrame1["Yaş"] > 0

Ali       False
Ayşe      False
Hatice     True
Said       True
Name: Yaş, dtype: bool

In [37]:
dataFrame1[dataFrame1["Yaş"] > 0] #Yaş column'u 0'dan büyük olanları getirir, 0'dan küçük olan row'ları siler, getirmez.

            Maaş       Yaş  Çalışma saati
Hatice  1.126119  0.565570       0.198574
Said   -2.732920  0.123096      -2.417522

In [38]:
dataFrame1[dataFrame1["Çalışma saati"] > 0]

            Maaş       Yaş  Çalışma saati
Ali    -1.023181 -0.532847       0.126800
Hatice  1.126119  0.565570       0.198574

## Index nasıl değiştirilir?

In [39]:
dataFrame1.reset_index()      # soldaki isim olan index yerine 0,1,2.. geldi. İsim index'i column oldu

    index      Maaş       Yaş  Çalışma saati
0     Ali -1.023181 -0.532847       0.126800
1    Ayşe  1.733404 -0.599304      -0.602347
2  Hatice  1.126119  0.565570       0.198574
3    Said -2.732920  0.123096      -2.417522

In [40]:
## dataFrame1 'i çağırırsak yine eski haline döner, index'i isimler olarak verir. 
## Kalıcı değişiklik için inplace kullanmak gerekir

In [41]:
yeniIndexListesi = ["Ali", "Ayş", "Hat", "Sai"]

In [42]:
dataFrame1["Yeni Index"] = yeniIndexListesi

In [43]:
dataFrame1

            Maaş       Yaş  Çalışma saati Yeni Index
Ali    -1.023181 -0.532847       0.126800        Ali
Ayşe    1.733404 -0.599304      -0.602347        Ayş
Hatice  1.126119  0.565570       0.198574        Hat
Said   -2.732920  0.123096      -2.417522        Sai

In [44]:
dataFrame1.set_index("Yeni Index")  # dataframe'ın index'i hangi column olacak onu belirtir.

                Maaş       Yaş  Çalışma saati
Yeni Index
Ali        -1.023181 -0.532847       0.126800
Ayş         1.733404 -0.599304      -0.602347
Hat         1.126119  0.565570       0.198574
Sai        -2.732920  0.123096      -2.417522

In [45]:
dataFrame1 ## Eski haline dönmüş

            Maaş       Yaş  Çalışma saati Yeni Index
Ali    -1.023181 -0.532847       0.126800        Ali
Ayşe    1.733404 -0.599304      -0.602347        Ayş
Hatice  1.126119  0.565570       0.198574        Hat
Said   -2.732920  0.123096      -2.417522        Sai

In [46]:
## Bu değişikliği kalıcı yapmak için:

In [47]:
dataFrame1.set_index("Yeni Index", inplace=True )  
#değişiklik kalıcı olarak yapılacak

In [48]:
dataFrame1

                Maaş       Yaş  Çalışma saati
Yeni Index
Ali        -1.023181 -0.532847       0.126800
Ayş         1.733404 -0.599304      -0.602347
Hat         1.126119  0.565570       0.198574
Sai        -2.732920  0.123096      -2.417522

In [49]:
dataFrame1.loc["Ayş"] # Ayş row'undaki bilgileri getirir

Maaş             1.733404
Yaş             -0.599304
Çalışma saati   -0.602347
Name: Ayş, dtype: float64

## Multi Index:

In [4]:
ilkIndexler = ["Babamın gölgesi","Babamın gölgesi","Babamın gölgesi","Erdem","Erdem","Erdem",]

In [5]:
icIndexler = ["Zeyneb","Osman","Mehmet", "Zepi", "Arif", "Kurtçuk"]

In [6]:
birlesmisIndex =  list(zip(ilkIndexler, icIndexler))

In [7]:
birlesmisIndex

[('Babamın gölgesi', 'Zeyneb'),
 ('Babamın gölgesi', 'Osman'),
 ('Babamın gölgesi', 'Mehmet'),
 ('Erdem', 'Zepi'),
 ('Erdem', 'Arif'),
 ('Erdem', 'Kurtçuk')]

In [10]:
birlesmisIndex2 = pd.MultiIndex.from_tuples(birlesmisIndex)

In [11]:
birlesmisIndex2

MultiIndex([('Babamın gölgesi',  'Zeyneb'),
            ('Babamın gölgesi',   'Osman'),
            ('Babamın gölgesi',  'Mehmet'),
            (          'Erdem',    'Zepi'),
            (          'Erdem',    'Arif'),
            (          'Erdem', 'Kurtçuk')],
           )

In [12]:
cizgiFilmListesi = [[40, "A"],[10, "B"], [30, "C"], [9, "D"], [10, "E"], [11, "F"] ]

In [22]:
cizgiFilmNumpyDizisi = np.array(cizgiFilmListesi)
cizgiFilmNumpyDizisi

array([['40', 'A'],
       ['10', 'B'],
       ['30', 'C'],
       ['9', 'D'],
       ['10', 'E'],
       ['11', 'F']], dtype='<U11')

In [23]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi, index=birlesmisIndex2, columns= ["Yaş", "Meslek"])

In [25]:
cizgiFilmDataFrame

                        Yaş Meslek
Babamın gölgesi Zeyneb   40      A
                Osman    10      B
                Mehmet   30      C
Erdem           Zepi      9      D
                Arif     10      E
                Kurtçuk  11      F

In [26]:
cizgiFilmDataFrame.loc["Babamın gölgesi"]

       Yaş Meslek
Zeyneb  40      A
Osman   10      B
Mehmet  30      C

In [27]:
cizgiFilmDataFrame.loc["Babamın gölgesi"].loc["Osman"]

Yaş       10
Meslek     B
Name: Osman, dtype: object

In [18]:
cizgiFilmDataFrame

                          Yaş Meslek
(Babamın gölgesi, Zeyneb)  40      A
(Babamın gölgesi, Osman)   10      B
(Babamın gölgesi, Mehmet)  30      C
(Erdem, Zepi)               9      D
(Erdem, Arif)              10      E
(Erdem, Kurtçuk)           11      F

In [29]:
cizgiFilmDataFrame.index.names = ["Film adı", "İsim"]

In [30]:
cizgiFilmDataFrame

                        Yaş Meslek
Film adı        İsim
Babamın gölgesi Zeyneb   40      A
                Osman    10      B
                Mehmet   30      C
Erdem           Zepi      9      D
                Arif     10      E
                Kurtçuk  11      F